void main() {
  //! Static Type
  //สามารถใช้ num ได้ เป็นได้ทั้งจำนวนเต็มและ ทศนิยม จะอ้างอิงตามค่าที่เก็บ(ถ้าเป็นงานใหญ่ควรระบุตัวแปรที่ตรงตัวไปเลยจะดีกว่า)
  // เครื่องหมาย ? คือ null หรือไม่มีการกำหนดค่าให้
  ////! ต้องใส่เครื่องหมาย ? ทุกครั้งเมื่อกำหนดชนิดตัวแปรหากกำหนดชนิดแล้วไม่ใส่จะ error(แต่หากเป็นแบบ dynamic หรือไม่ได้กำหนดตัวแปรไม่ต้องใส่ก็ได้)

  int age = 20;
  double pi = 3.14;
  String name = 'nay';
  bool isCheck = true;

  print(age);
  print(pi);
  print(name);
  print(isCheck);
  //! Dynamic Type จะไม่มีการระบุชนิดตัวแปร
  //หากเป็นชนิดตัวแปร var ระบุเป็นค่าอะไรก็ได้แต่เปลี่ยนชนิดข้อมูลไม่ได้
  //! แต่จะไม่สามารถเปลี่ยนค่าได้(แต่ต้องกำหนดว่า var เป็นอะไรก่อนเช่น String)
  var tree = 'orange';
  print('ค่า tree แรก $tree');
  tree = 'apple';
  print('เมื่อเปลี่ยนค่า tree สอง $tree');
  //! error เพราะ var ไม่สามารถเปลี่ยนค่าได้
  //* tree = 6;
  //* print(tree);

  //ถ้าเป็น Dynamic จะสามารถเปลี่ยนตัวแปรได้เลื่อยๆ
  dynamic tree2 = 'apple';
  print(tree2);
  tree2 = 2; //เปลี่ยนมาเก็บเป็น int

  // ========================
  // int x = 10;
  // int y = 20;
  // int z = 30;

  // สามารถย่อได้
  int x = 10, y = 20, z = 30;
  print(x);
  print(y);
  print(z);
}
