public class ForLoop {
    public static void main(String[] args) {
        // 3 ส่วน
        // ส่วนตัวแปรเริ่มต้น => ตัวนับรอบ
        // ส่วนเงื่อนไข
        // การเพิ่มค่าลดค่า
        /*
         * for (ตัวแปรเริ้มต้น;เงื่อนไข;การเพิ่มค่า/ลดค่า){
         * คำสั่งทีจะทำซ้ำ
         * }
         */
        // int count; ถ้าประกาศแบบนี้สามารถนำไปใช้ที่อื่นได้ด้วย
        for (int count = 1; count <= 10; count++) {// ถ้าประกาศด้านในใช้ได้แค่ใน Loop
            System.out.println("");
        }
    }
}
